# OLDGetMatDestiny

## Description
Returns the density of the specified construction material.

```pascal
FUNCTION OLDGetMatDestiny(materialName : STRING) : REAL;
```

```python

def vs.OLDGetMatDestiny(materialName):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|materialName|STRING||

## Version
Availability: from Vectorworks 2018
## Category
* Truss Analysis